Revit 2026 API

# MEPSectionTotalCoefficient Property

---

The loss coefficient of the section.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TotalCoefficient { get; }
```
```vb
Public ReadOnly Property TotalCoefficient As Double
	Get
```
```cpp
public:
property double TotalCoefficient {
	double get ();
}
```
```fsharp
member TotalCoefficient : float with get
```

#### Property Value

Double

It's total of all fittings and segments. Coefficient is a number. The unit type is UT_Number.

#### Reference

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace